/**
 * цвет на основе уровня прогресса.
 * Уровень прогресса (0-10).
 * Цвет в формате HEX.
 */

const progressColors: Record<number, string> = {
    0: 'rgba(139,0,0,0.32)', // Темно-красный #8B0000
    1: 'rgba(255,0,0,0.3)', // Красный #FF0000
    2: 'rgba(255,99,71,0.3)', // Светло-красный (Tomato) #FF6347
    3: 'rgba(255,140,0,0.32)', // Темно-оранжевый #FF8C00
    4: 'rgba(255,165,0,0.27)', // Оранжевый #FFA500
    5: 'rgba(255,215,0,0.37)', // Светло-оранжевый (Gold) #FFD700
    6: 'rgba(218,165,32,0.39)', // Темно-желтый (Goldenrod) #DAA520
    7: 'rgba(255,255,0,0.55)', // Желтый #FFFF00
    8: 'rgba(222,222,71,0.55)', // Светло-желтый (Light Yellow) #FFFFE0
    9: 'rgba(144,238,144,0.61)', // Светло-зеленый (Light Green) #90EE90
    10: 'rgba(0,128,0,0.59)' // Зеленый #008000
};

export default progressColors;

/**
 * Default colors :
 * 0 - #8B0000 Темно-красный
 * 1 - #FF0000 Красный
 * 2 - #FF6347 Светло-красный (Tomato)
 * 3 - #FF8C00 Темно-оранжевый
 * 4 - #FFA500 Оранжевый
 * 5 - #FFD700 Светло-оранжевый (Gold)
 * 6 - #DAA520 Темно-желтый (Goldenrod)
 * 7 - #FFFF00 Желтый
 * 8 - #FFFFE0 Светло-желтый (Light Yellow)
 * 9 - #90EE90 Светло-зеленый (Light Green)
 *10 - #008000 Зеленый
 */